Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бартерный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ПанельСтраниц/Ext/Module.bsl
Процедура ЗаполнитьСтраницыОтборов(ЭлементыФормы, ПоВидДоговора = Ложь) экспорт
	
	ЭлементыФормы.ПанельСтраниц.Страницы.Очистить();
	для Каждого страница из ЭлементыФормы.ПанельСтраниц.Страницы Цикл 
		страница.Видимость = Ложь;
	КонецЦикла;	
	ЭлементыФормы.ПанельСтраниц.Страницы.Добавить("К"+"Всі","Всі");
	
	////Если ПоПодразделениям Тогда 
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	Филиалы.Ссылка,
	//		|	Филиалы.Код,
	//		|	Филиалы.Наименование
	//		|ИЗ
	//		|	Справочник.Филиалы КАК Филиалы
	//		|ГДЕ
	//		|	НЕ Филиалы.ПометкаУдаления";
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		ЭлементыФормы.ПанельСтраниц.Страницы.Добавить("К"+ВыборкаДетальныеЗаписи.Код,ВыборкаДетальныеЗаписи.Наименование);
	//	КонецЦикла;
	Если ПоВидДоговора Тогда
		
		ЭлементыФормы.ПанельСтраниц.Страницы.Добавить("КСПокупателем",Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		ЭлементыФормы.ПанельСтраниц.Страницы.Добавить("КСКомиссионером",Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
		
	Иначе 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НаправленияЗатрат.Ссылка,
			|	НаправленияЗатрат.СтатьяЗатратПоУмолчанию,
			|	НаправленияЗатрат.Наименование
			|ИЗ
			|	Справочник.НаправленияЗатрат КАК НаправленияЗатрат
			|ГДЕ
			|	НЕ НаправленияЗатрат.ПометкаУдаления";
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЭлементыФормы.ПанельСтраниц.Страницы.Добавить("К"+ВыборкаДетальныеЗаписи.Наименование,ВыборкаДетальныеЗаписи.Наименование);
		КонецЦикла;
	КонецЕсли;	

	//Иначе 	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	Организации.Ссылка,
	//		|	Организации.Код,
	//		|	Организации.Наименование
	//		|ИЗ
	//		|	Справочник.Организации КАК Организации
	//		|ГДЕ
	//		|	НЕ Организации.ПометкаУдаления";
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		ЭлементыФормы.ПанельСтраниц.Страницы.Добавить("К"+ВыборкаДетальныеЗаписи.Код,ВыборкаДетальныеЗаписи.Наименование);
	//	КонецЦикла;
	//КонецЕсли;
КонецПроцедуры	

Процедура ПанельСтраницПриСменеСтраницы(Элемент, ТекущаяСтраница, ЭлементыФормы, ДокументСписок, ПоВидДоговора = Ложь) экспорт
	
	//Если ПоПодразделениям Тогда
	Если ПоВидДоговора Тогда
		//по виду договора
		ДокументСписок.Отбор.Сбросить();
		Если не ЭлементыФормы.ПанельСтраниц.ТекущаяСтраница.имя = "КВсі" Тогда
			
			ТекСсылка = Перечисления.ВидыДоговоровКонтрагентов[Сред(ЭлементыФормы.ПанельСтраниц.ТекущаяСтраница.имя,2)];
			
			ДокументСписок.Отбор.ВидДоговора.ВидСравнения  = ВидСравнения.Равно;
			ДокументСписок.Отбор.ВидДоговора.Значение 	 = ТекСсылка;
			ДокументСписок.Отбор.ВидДоговора.Использование = Истина;
		КонецЕсли;
	Иначе 
		ТекСсылка = Справочники.НаправленияЗатрат.НайтиПоНаименованию(Сред(ЭлементыФормы.ПанельСтраниц.ТекущаяСтраница.имя,2));
		Если не ТекСсылка.Пустая() Тогда 
			ДокументСписок.Отбор.Сбросить();
			//
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//	"ВЫБРАТЬ
			//	|	НаправленияЗатрат.Ссылка
			//	|ИЗ
			//	|	Справочник.НаправленияЗатрат КАК НаправленияЗатрат
			//	|ГДЕ
			//	|	НаправленияЗатрат.Ссылка = &Ссылка";
			//
			//Запрос.УстановитьПараметр("Ссылка", ТекСсылка);
			//РезультатЗапроса = Запрос.Выполнить();
			//спНаправленияЗатрат = Новый СписокЗначений;
			//спНаправленияЗатрат.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
			ДокументСписок.Отбор.НаправлениеЗатрат.ВидСравнения  = ВидСравнения.Равно;
			ДокументСписок.Отбор.НаправлениеЗатрат.Значение 	 = ТекСсылка;
			ДокументСписок.Отбор.НаправлениеЗатрат.Использование = Истина;
		Иначе
			ДокументСписок.Отбор.Сбросить();
		КонецЕсли;
	КонецЕсли;
	//иначе
	//	//по орг
	//	ТекСсылка = Справочники.Организации.НайтиПоКоду(Сред(ЭлементыФормы.ПанельСтраниц.ТекущаяСтраница.имя,2));
	//	Если не ТекСсылка.Пустая() Тогда 
	//		ДокументСписок.Отбор.Сбросить();
	//		ДокументСписок.Отбор.Найти("Организация").Установить(ТекСсылка);
	//	КонецЕсли;	
	//КонецЕсли;	
	
КонецПроцедуры

Процедура КонтрагентПриИзменении(Элемент, ДокументСписок) экспорт
	ДокументСписок.Отбор.Контрагент.Использование = ЗначениеЗаполнено(ДокументСписок.Отбор.Контрагент.Значение);
КонецПроцедуры

Процедура КонтрагентОчистка(Элемент, СтандартнаяОбработка, ДокументСписок) экспорт
	ДокументСписок.Отбор.Контрагент.значение = Справочники.Контрагенты.ПустаяСсылка();
КонецПроцедуры
